{"data":{"markdownRemark":{"html":"<h3>JavaScript And The Web</h3>\n<p><a href=\"http://2ality.com/2017/11/currying-in-js.html\">Currying In JS | 2ality</a> - A nice round up of the different approaches for using currying (a functional programming concept) in JavaScript.  My favorite line: <em>“One of JavaScript’s best traits is how many different styles of programming it can accommodate.”</em> This is one of my favorite things about the language as well.</p>\n<p><a href=\"https://medium.com/@dhruvrajvanshi/thoughts-on-redux-and-its-similarities-with-oop-6d200f34656\">Thoughts on Redux and its similarities with OOP | Dhruv Rajvanshi</a> - I always find it useful to understand when core concepts are shared across very different looking tools and paradigms</p>\n<h3>Programming Tools and Practices</h3>\n<p><a href=\"https://hacks.mozilla.org/2017/11/entering-the-quantum-era-how-firefox-got-fast-again-and-where-its-going-to-get-faster/\">Entering the Quantum Era—How Firefox got fast again and where it’s going to get faster | Lin Clark</a> - I’ve been using Firefox 57 as my primary browser this week and so far it is very very nice.  Other than a single Chrome-specific extension that I’m missing, and a few minor devtool annoyances, everything has worked great.  And it is blazing fast.</p>\n<p><a href=\"https://code.visualstudio.com/blogs/2017/11/15/live-share\">Introducing Visual Studio Live Share | Microsoft</a> and\n<a href=\"https://blog.atom.io/2017/11/15/code-together-in-real-time-with-teletype-for-atom.html\">Code together in real time with Teletype for Atom | Github</a>  - In what appears to be a crazy coincidence, both Atom and Visual Studio/Visual Studio Code announced new tools for collaborating with other developers on code, using a google docs-like experience.  Atom’s solution is available in beta today, and is a free WebRTC based peer-to-peer solution for editing code together, with the primary user sharing their active tab with anybody who has the uniqueID for your session.  It also includes open-sourcing a library that would let other editors implement its document protocol. Microsoft’s solution is more ambitious, supporting both Visual Studio and Visual Studio code, and allowing users access to a whole shared workspace.  It is just an announcement for now though, and it’s not clear if it is a peer to peer or centralized solution, nor whether it will have a cost associated with it.  Regardless, both solutions look amazingly cool.</p>\n<blockquote class=\"twitter-tweet\" data-lang=\"en\"><p lang=\"en\" dir=\"ltr\">As one of the three engineers that built Teletype, I share your curiosity! 🙈</p>&mdash; Jason Rudolph (@jasonrudolph) <a href=\"https://twitter.com/jasonrudolph/status/930856578915344384?ref_src=twsrc%5Etfw\">November 15, 2017</a></blockquote>\n<p><a href=\"http://amzn.to/2AVaAjx\">Managing Humans | Michael Lopp (AKA Rands)</a> - This book was a great roundup of some of the best writings from one of my favorite blogs <a href=\"http://randsinrepose.com/\">Rands in Repose</a>.  Michael Lopp has been a manager and executive at Netscape, Apple, Palantir, Pinterest and now Slack.  He’s seen a lot.  While the book is aimed first at managers, it’s helpful for anyone who is interested in understanding how engineering teams work, and how to lead or work in one better.</p>\n<h3>Non-Tech</h3>\n<p><a href=\"https://www.nytimes.com/2017/11/09/sports/aaron-hernandez-brain-cte.html?_r=0\">On the Table, the Brain Appeared Normal | The New York Times</a> - Powerful reading about the dangers of football, a sport that I still love watching.  <a href=\"https://www.si.com/nfl/2017/09/21/aaron-hernandez-brain-cte-video-photos\">More context here if you’re confused after reading the NYT story</a>.</p>\n<p><a href=\"https://www.nytimes.com/2017/11/12/us/nsa-shadow-brokers.html?_r=0\">Security Breach and Spilled Secrets Have Shaken the N.S.A. to Its Core | The New York Times</a> - Interesting to see such mainstream questioning of the NSA’s habit of hording zero-day exploits.  Don’t read this one if you want to maintain any naive good feelings about US cybersecurity.</p>","frontmatter":{"title":"Weekly Links: November 17th 2017","keywords":"","category":"opinion","date":"2017/11/17","path":"/2017/11/17/weekly-links-11-17-17/","layout":"weekly-links","hideFooter":null,"hideSidebar":null},"fields":{"slug":"/2017/11/17/weekly-links-11-17-17/"}}},"pageContext":{"slug":"/2017/11/17/weekly-links-11-17-17/","relatedPosts":[{"path":"/2017/11/03/friday-links/","data":{"title":"Weekly Links: November 3rd 2017","path":"/2017/11/03/friday-links/","description":"The very first Weekly Links post: Snapshot Testing and being Tech-wise","date":"2017-11-03T04:00:00+00:00","category":"opinion"}},{"path":"/2017/11/10/friday-links/","data":{"title":"Weekly Links: November 10th 2017","path":"/2017/11/10/friday-links/","description":"React, Social Media, and Comments","date":"2017/11/10","category":"opinion"}},{"path":"/2018/09/23/weekly-links-09-23-30/","data":{"title":"Weekly Links: October 7th","path":"/2018/09/23/weekly-links-09-23-30/","description":"Keys in React, Destructuring, and Followership","date":"2018/10/07","category":"opinion"}}]}}