{"data":{"markdownRemark":{"html":"<p>2019 was the 6th full year of this blog, and it was a bit up and down posting wise.  For the first half of the year I published more or less a post a week, with 24 posts from January till July.  But this is only my 2nd post since then.  </p>\n<p>Turns out that starting a new job while learning to be a parent sucks up a lot of time!  I’m not making any promises for 2020, but I expect that my writing rate will fall somewhere in between the first 7 months and last 5 months of 2019.  In the meantime, here’s a brief look back at the year on the blog.</p>\n<p>This was my first year where I spent the full year managing people, and that was reflected in the blog’s topics as well as where I spent my time.  </p>\n<h3>Most Read Posts Published in 2018</h3>\n<ul>\n<li><a href=\"https://benmccormick.org/2019/02/11/reusable-react\">Reusable Code In React: Inheritance, Composition, Decorators and Mixins</a> The most popular post for the year was also one of my favorites: a dive into the various mechanisms React provides for reusing code.</li>\n</ul>\n<ul>\n<li>\n<p><a href=\"https://benmccormick.org/2019/01/28/readable-async\">Improving Code Readability With Async/Await</a> I really like <code class=\"language-text\">async/await</code> but its not always clear how to move older patterns to use it.  This was just a quick example of taking some ugly callback code and converting it to use async await.</p>\n</li>\n<li>\n<p><a href=\"https://benmccormick.org/2019/01/07/the-concerns-of-fe-architecture/\">What’s involved in Front End Architecture?</a>\nAnother one of my favorite posts to write, this is a look at what types of things developers should be thinking about when they consider front end architecture.</p>\n</li>\n</ul>\n<h3>Languages and Libraries I used a lot of in 2019</h3>\n<p>JavaScript (ES6), React (including hooks), PostgreSQL, lodash, Jest, Immer, CSS Modules, Redux, </p>\n<h3>Tech I want to try in 2019</h3>\n<p>We’re starting to roll out TypeScript at <a href=\"https://www.kustomer.com/\">Kustomer</a> and I’m excited to use it in production for the first time.  My code time is more limited these days, so that will probably be my main area for learning as I focus more on helping other people get stuff done.</p>\n<h3>Blogs I started following in 2019</h3>\n<ul>\n<li><a href=\"https://lethain.com/\">Irrational Exuberance! by Will Larson</a> - a great engineering / technical leadership blog</li>\n</ul>\n<h3>Blogs I read every post from in 2019</h3>\n<p><a href=\"https://overreacted.io/\">Overreacted by Dan Abramov</a>, <a href=\"https://larahogan.me/\">Lara Hogan’s Engineering Leadership blog and newsletter</a>, <a href=\"http://randsinrepose.com/\">Rands In Repose</a> </p>\n<h3>Software I used (nearly) every day in 2019</h3>\n<p>MacOS/iOS, Google Search, Chrome/Safari/Firefox, GMail/MailPlane 3, Twitter/Tweetbot, Feedbin/Reeder, iMessage, Slack, Jira, 1Password, VS Code, iTerm, Fish Shell, Github/Bitbucket, Fantastical, Spotify, Bear, CloudApp, Dash, Postman</p>\n<h3>Best Technical Books I read in 2019</h3>\n<ul>\n<li><a href=\"https://amzn.to/35j1Jq1\">The Pragmatic Programmer 20th Anniversary Edition</a> - A huge update from the 1st edition, this remains my #1 book recommendation for any professional software developer</li>\n<li><a href=\"https://amzn.to/2QhpkTH\">Accelerate</a> - A great look at the impact improving devops/release practices can have on software teams/companies</li>\n</ul>\n<h3>Best Technical Leadership Books I Read in 2019</h3>\n<ul>\n<li><a href=\"https://abookapart.com/products/resilient-management\">Resilient Management</a> - A great collection of management wisdom from Lara Hogan.  Nothing revolutionary here for those who already follow her blog/newsletter, but its great to have it all together in one place.</li>\n<li><a href=\"https://amzn.to/2QyJLKM\">The Manager’s Path</a> - A super helpful book for anyone thinking about their career path in tech, especially if they’re considering management.  Lots of helpful tips for those already managing people as well.</li>\n<li><a href=\"https://amzn.to/2ZHbFbx\">An Elegant Puzzle</a> - Another “blog book”, this one is a bit of a grab bag of topics, but the content is so high quality it was completely worth it.</li>\n<li><a href=\"https://amzn.to/2Fc4izu\">Turn The Ship Around</a> - Not tech-specific, but one of the best books on leadership I’ve read, in the form of a history of a nuclear submarine crew getting ready to deploy.</li>\n</ul>\n<h3>Best Non-Technical Books I read in 2019</h3>\n<ul>\n<li><a href=\"https://amzn.to/369CpDX\">I Hear You</a> - A small practical book on validation that will make you a better friend / spouse / coworker.</li>\n<li><a href=\"https://amzn.to/2ZHuM52\">Why We Sleep</a> - A fascinating book on the (pop) science behind sleep</li>\n<li><a href=\"https://amzn.to/2ZH3bRR\">Team Of Rivals</a> - A very readable history of the Lincoln presidency focused on his relationships with the other candidates for President in 1860. Incredibly well done.</li>\n<li><a href=\"https://amzn.to/2MH6F1e\">Evicted: Poverty and Profit in the American City</a> - A sobering look at how laws, norms and expectations around rentals and evictions in America contribute to spirals of poverty.  Another very well written book, make sure to read the end to understand the research that went into it and allowed for the very personal feel.</li>\n<li><a href=\"https://amzn.to/2sFrDqz\">The Common Rule</a> - This is a Christian look at how ritual and habit can help us overcome modern distractions and focus on the things that are important.  I’ve read a lot of books in this genre in recent years (Deep Work / Indistractable / The Tech Wise Family) and this was my favorite.</li>\n<li><a href=\"https://amzn.to/2QyKhsc\">The Foundation Trilogy</a> - Classic scifi, and a great read. Fascinating to read a mid 1900s view of the future and realize that while space travel and force fields sounded great, it was inconceivable that casual tobacco use in the home might go away. </li>\n</ul>","frontmatter":{"title":"2019 Roundup","keywords":null,"category":"meta","date":"2019/12/31","path":"/2019-roundup","layout":"post","hideFooter":null,"hideSidebar":null},"fields":{"slug":"/2019-roundup"}}},"pageContext":{"slug":"/2019-roundup","relatedPosts":[{"path":"/2018/02/07/react-confessions/","data":{"title":"React Architecture Confessions","path":"/2018/02/07/react-confessions/","description":"The mistakes I made while learning React and why I made them","date":"2018/02/07","category":"fe-architecture"}},{"path":"/2018/07/04/evil-javascript/","data":{"title":"Evil JavaScript","path":"/2018/07/04/evil-javascript/","description":"The code you write when you don't care about people","date":"2018/07/04","category":"javascript"}},{"path":"/2018/06/05/es6-the-bad-parts/","data":{"title":"ES6: The Bad Parts","path":"/2018/06/05/es6-the-bad-parts/","description":"Three years later, what parts of ES6 have I stopped using?","date":"2018/06/05","category":"javascript"}}]}}