{"data":{"markdownRemark":{"html":"<h3>TC39 and the future of JavaScript/ECMAScript</h3>\n<p><a href=\"https://developers.google.com/web/updates/2018/03/smooshgate\">#SmooshGate FAQ  |  Mathias Bynens</a> - A great explanation both of the background behind the recent twitter controversy over <code class=\"language-text\">Array.prototype.smoosh</code> as well as the TC39 process generally.</p>\n<p><a href=\"https://github.com/zenparsing/js-classes-1.1\">js-classes-1.1 | Allen Wirfs-Brock</a> - This is the new proposal for expanding JS classes I mentioned in my <a href=\"https://benmccormick.org/2018/03/16/proposals-in-production/\">post</a> last Friday.  It aims to be a more minimalist take on expanding class capabilities (primarily adding private state syntax) than other proposals that have come along over the last few years.</p>\n<p><a href=\"https://gist.github.com/wycats/b1c96c67074396a239abd60f55087adc\">thoughts.md | Yehuda Katz</a> - This was a response to the JS Classes 1.1 proposal from Yehuda Katz, the lead proponent of adding decorator syntax for JavaScript classes.  He compares the new proposal to existing proposals, with specific concerns for how it would interop with decorators.</p>\n<h3>Computer Science and Software Engineering</h3>\n<p><a href=\"https://medium.com/basecs\">basecs | Vaidehi Joshi</a> - While I’ve been starting to consider how to explain CS concepts for front end developers without a CS background, I found this excellent beginner set of CS articles written by Vaidehi Joshi on Medium over the past year.  Worth diving into, especially if you like fun visuals.</p>\n<p><a href=\"https://blog.nrwl.io/the-3-skills-that-helped-me-become-a-better-software-engineer-8b06a37becf3\">The 3 Skills That Helped Me Become a Better Software Engineer | Victor Savkin</a> - This is worth sharing solely for the advice about mental models.  In my experience the ability to think in abstractions (and understand when you need to dig deeper) is one of the biggest hurdles in programming when trying to grow from a beginner to a more advanced software engineer.</p>\n<h3>Books</h3>\n<p>I’ve been working through a goal to read 30 books in a year, and have worked through a few more books recently.  Here are two good ones.</p>\n<p><a href=\"https://amzn.to/2Gbh9R2\">The Martian | Andy Weir</a> - Yes I know I’m 3 years late on this one.  But I’m sure there are other lost souls like me who entered 2018 without reading this book.  If you love tech and science (and I’m guessing you do if you’re reading this), you should find a way to read The Martian.  My first thought when I started reading it was “This is great”.  My second thought was “How in the world did this end up becoming a Hollywood Blockbuster starring Matt Damon?“.  The Martian is unapologetically geeky, and it is “real science” fiction, with a very human core. I loved it.</p>\n<p><a href=\"https://amzn.to/2G1h9ah\">Death By Meeting | Patrick Lencioni</a> - This was a recommendation from my manager, and is a great read for anyone who wants to improve the meetings they’re in at work.  It’s written in a “business fable” style, with a story serving to illustrate the principles it is trying to teach.  One thing I love is that it tells the story of the principles being implemented from a lower rung employee, rather than a top-down executive driven approach, so hopefully it can be inspirational to you even if you feel like you wouldn’t be able to change your meeting culture even if you knew what to do.</p>","frontmatter":{"title":"Weekly Links: March 24th","keywords":"martian TC39 computer science meetings","category":"opinion","date":"2018/03/24","path":"/2018/03/24/weekly-links-03-11-24/","layout":"weekly-links","hideFooter":null,"hideSidebar":null},"fields":{"slug":"/2018/03/24/weekly-links-03-11-24/"}}},"pageContext":{"slug":"/2018/03/24/weekly-links-03-11-24/","relatedPosts":[{"path":"/2013/06/08/customer-culture-revisited","data":{"title":"Customer Culture Revisited","path":"/2013/06/08/customer-culture-revisited","description":"Talking about how Microsoft culture impacts their products","date":"2013-06-08T18:45:00+00:00","category":"opinion"}},{"path":"/2013/08/15/somewhat-open","data":{"title":"Somewhat Open","path":"/2013/08/15/somewhat-open","description":"What is an open API?","date":"2013-08-15T16:15:00+00:00","category":"opinion"}},{"path":"/2017/11/10/friday-links/","data":{"title":"Weekly Links: November 10th 2017","path":"/2017/11/10/friday-links/","description":"React, Social Media, and Comments","date":"2017/11/10","category":"opinion"}}]}}