{"data":{"markdownRemark":{"html":"<p>Wouldn’t it be nice if your text editor just did what you said instead of making you slowly and manually add and delete characters?  Vim doesn’t speak English, but it has a language of its own, built out of composable commands, that is much more efficient than the simple movement and editing commands you’ll find in other editors.  In my <a href=\"http://benmccormick.org/2014/06/30/learning-vim-in-2014-the-basics/\">last post</a>, I took an initial look at Vim as a language.  I’m going to dive deeper into that here.</p>\n<h3>Vim Verbs: What can you do?</h3>\n<p>Vim’s “verbs” mostly fall into 2 main categories.  Some of them act on a single character, and others act on a “motion” or “text object”.  We’ll look at motions in a second, but lets start by looking at the verbs.</p>\n<h4>Single character verbs</h4>\n<p>So like I said, there are a few vim actions that act on a single character.  They act as shortcuts for actions that you can also perform with motions, and allow you to save a few keystrokes.</p>\n<table>\n<tr>\n<th>Command</th>\n<th>Action</th>\n</tr>\n<tr>\n<td>x</td>\n<td>Delete character under the cursor</td>\n</tr>\n<tr>\n<td>r</td><td>Replace character under cursor with another character</td>\n</tr><tr>\n<td>s</td><td>Delete character under cursor and move to insert mode</td>\n</tr>\n</table>\n<p>These are great commands to know, and things that I use daily, but they act as a bit of an island.  Let’s look at some verbs with more power.</p>\n<table>\n<tr>\n<th>Command</th>\n<th>Action</th>\n</tr>\n<tr>\n<td>d<motion></td><td>Delete text specified by motion</td>\n</tr><tr>\n<td>c<motion></td><td>Delete text specified by motion and go into insert mode</td>\n</tr><tr>\n<td>y<motion></td><td>Yank (copy) text specified by motion</td>\n</tr>\n</table>\n<p>These aren’t the only 3 actions that you can use with motions, but they’re probably the most important. The first 2 are roughly the same as deleting or cutting in most instances, with the option to choose what mode you end in. The 3rd is Vim’s version of copying.</p>\n<h4>Motions</h4>\n<p>So how do we use these actions?  You’ll notice that if you type any of the above characters into Vim by themselves, nothing happens.  That’s because they’re expecting something to act on.  If you’re a grammar nerd or remember your 8th grade english classes, you can think of these as transitive verbs that need to act on a direct object.  These “direct objects” come in 2 forms, motions and text objects.  Motions are the motion commands that you can use at any time to move around Vim.  Some examples:</p>\n<table>\n<tr>\n<th>Command</th>\n<th>Motion</th>\n</tr>\n<tr>\n<td>$<motion></td><td>Go to the end of the line</td>\n</tr><tr>\n<td>G<motion></td><td>Go to the end of the file</td>\n</tr><tr>\n<td>f.<motion></td><td>Go to the next occurrence of `.` on the current line</td>\n</tr>\n</table>\n<p>All of these commands work as motions on their own, but when you combine them with actions you can get powerful effects.  So <code class=\"language-text\">d$</code> means “delete to the end of the line”.  <code class=\"language-text\">cf)</code> means “change through the next closing parentheses” and <code class=\"language-text\">yG</code> means copy everything through the end of the file.  The list above is only a small subset of the motions available.  I’d suggest learning 1 or 2 to start and using them when appropriate.  As you get more comfortable with Vim you can continue to add more, and each one will unlock a set of commands for all of the actions you know.</p>\n<p>The second type of “direct object” that Vim verbs can take is a text object.  You can think of text objects as a “defined chunk of text.”  Some examples include selecting words, html tag contents, or the contents of a function.</p>\n<table>\n<tr>\n<th>Command</th>\n<th>Text Object</th>\n</tr>\n<tr>\n<td>iw</td><td>Applies to everything in the current word</td>\n</tr><tr>\n<td>it<motion></td><td>Applies to everything in current xml/html tag</td>\n</tr><tr>\n<td>i{<motion></td><td>Applies to everything inside nearest curly brackets</td>\n</tr>\n</table>\n<p>So using text objects you can change the contents of a word with the easily memorizable <code class=\"language-text\">ciw</code> (change in word), or copy the contents of an html <code class=\"language-text\">&lt;a&gt;</code> tag with yit.  It’s worth mentioning here that one of the most powerful text objects is a bit of an oddball.  A really common thing people do is applying an action to the current line.  Vi’s language makes this easy by allowing the shortcut for this text object to be a simple repeat of the action.  So <code class=\"language-text\">yy</code> yanks the current line, <code class=\"language-text\">dd</code> deletes it, and <code class=\"language-text\">cc</code> changes it.</p>\n<h4>Piece by Piece</h4>\n<p>The key here is that learning Vim isn’t something you do in a weekend. It’s an iterative process. Since the actions, motions, and text objects build on themselves, you can start to grow your toolbox exponentially as time goes on.  But you’ll want to start with a few commands that you find make you productive.  I’ve personally found <code class=\"language-text\">ciw</code>, <code class=\"language-text\">dd</code> and <code class=\"language-text\">ci(</code> to be incredibly useful commands, and a great place to start as you learn to use these commands instead of the slower “mouse and select” methods that you may be used to. When we learn languages we all start with basic sentences, learn the grammar rules and grow from there.  Vim is no different. Start small and add to your toolbox as you build great things with it.</p>\n<hr>\n<h3>More Resources</h3>\n<ul>\n<li><a href=\"http://stackoverflow.com/a/1220118/1424361\">Your problem with Vim is that you don’t grok vi</a> - A concise explanation of what makes vi/vim special, and one of the most popular answers ever on Stack Overflow.</li>\n<li><a href=\"https://medium.com/@mkozlows/why-atom-cant-replace-vim-433852f4b4d1\">Why Atom can’t replace Vim</a> - A great piece on the big picture importance of composable commands.</li>\n<li><a href=\"http://blog.carbonfive.com/2011/10/17/vim-text-objects-the-definitive-guide/\">Vim Text Objects: The Definitive Guide</a> - This is a nice rundown of the different text objects available, including some that you can add using plugins.</li>\n</ul>\n<hr>\n<h4>Update</h4>\n<p>This post is currently on the front page of Hacker News. Feel free to join in the conversation <a href=\"https://news.ycombinator.com/item?id=7976493\">there</a></p>","frontmatter":{"title":"Learning Vim in 2014: Vim as Language","keywords":"vim language grammar text object","category":"tools","date":"2014-07-02T11:27:00+00:00","path":"/2014/07/02/learning-vim-in-2014-vim-as-language","layout":"post","hideFooter":null},"fields":{"slug":"/2014/07/02/learning-vim-in-2014-vim-as-language"}}},"pageContext":{"jsonName":"2014-07-02-learning-vim-in-2014-vim-as-language-395","internalComponentName":"Component20140702LearningVimIn2014VimAsLanguage","path":"/2014/07/02/learning-vim-in-2014-vim-as-language","component":"/home/travis/build/benmccormick/benmccormickorg/src/templates/blog-post.js","componentChunkName":"component---src-templates-blog-post-js","context":{"slug":"/2014/07/02/learning-vim-in-2014-vim-as-language","relatedPosts":[{"path":"/learning-vim-in-2014","data":{"title":"Learning Vim in 2014","path":"/learning-vim-in-2014","description":"A series of beginner level articles on Vim","date":null}},{"path":"/2014/11/10/vim-workflows-file-switching-strategies","data":{"title":"Vim Workflows: File Switching","path":"/2014/11/10/vim-workflows-file-switching-strategies","description":"A look at the different approaches you can take to managing files in Vim","date":"2014-11-10T04:06:52+00:00"}},{"path":"/2014/07/16/learning-vim-in-2014-vim-as-art","data":{"title":"Learning Vim in 2014: Vim as Art","path":"/2014/07/16/learning-vim-in-2014-vim-as-art","description":"How using Vim is more of an artform than a science","date":"2014-07-16T10:41:00+00:00"}}]},"updatedAt":1530498435015,"pluginCreator___NODE":"Plugin default-site-plugin","pluginCreatorId":"Plugin default-site-plugin","componentPath":"/home/travis/build/benmccormick/benmccormickorg/src/templates/blog-post.js","slug":"/2014/07/02/learning-vim-in-2014-vim-as-language","relatedPosts":[{"path":"/learning-vim-in-2014","data":{"title":"Learning Vim in 2014","path":"/learning-vim-in-2014","description":"A series of beginner level articles on Vim","date":null}},{"path":"/2014/11/10/vim-workflows-file-switching-strategies","data":{"title":"Vim Workflows: File Switching","path":"/2014/11/10/vim-workflows-file-switching-strategies","description":"A look at the different approaches you can take to managing files in Vim","date":"2014-11-10T04:06:52+00:00"}},{"path":"/2014/07/16/learning-vim-in-2014-vim-as-art","data":{"title":"Learning Vim in 2014: Vim as Art","path":"/2014/07/16/learning-vim-in-2014-vim-as-art","description":"How using Vim is more of an artform than a science","date":"2014-07-16T10:41:00+00:00"}}]}}