{"data":{"markdownRemark":{"html":"<p>The Unix philosophy for designing software, “Make each program do one thing well”, is a piece of wisdom that goes beyond just programming.  For instance, it also applies to non-fiction writing.  When learning, I find that I gravitate towards small focused resources, rather than monolithic books or websites that aim to teach everything about a specific topic.</p>\n<p><a href=\"http://atomicdesign.bradfrost.com/\">Atomic Design</a> by Brad Frost is a book that does one thing really well: it explains what a design system is, and how you can implement one in your organization.  It doesn’t try to be a book about CSS, design styles or any of the other myriad topics that touch against design systems.  That focus serves it well, and I found it to be well worth my time.</p>\n<p><a href=\"http://bradfrost.com/blog/link/design-systems/\">Design Systems</a>  are an organized toolkit for creating digital products.  They’re a set of elements, widgets, patterns, and layouts (atoms, molecules, organisms and templates in the language of the book) that can be combined to build complex sites and applications.  The idea is pretty simple.  But there are some real challenges in implementing one.</p>\n<ol>\n<li><em>What content belongs in a design system?  Where do we draw the boundary as to what belongs and what doesn’t?</em></li>\n<li><em>How do you build a tool for your design system so that patterns are easily findable, usable, and understandable?</em></li>\n<li><em>How do you keep a design system relevant over time as the product(s) change?</em></li>\n<li><em>How do you convince budget-conscious organizations that maintaining a design system is a good use of time and money?</em></li>\n</ol>\n<p>After a brief introduction to the ideas behind design systems and pattern libraries, these are the challenges that Atomic design tackles.  It discusses a hierarchy for patterns, and methods for pulling them out of existing applications, then moves on to talking about tools for implementing a pattern library, and techniques for navigating organizational politics when starting and maintaining a design system.</p>\n<p>So this book <strong>will be helpful</strong> for you if you are</p>\n<ol>\n<li>Struggling to deal with inconsistencies in your interfaces, or constantly doing custom UI work for each new feature</li>\n<li>Considering implementing a design system/pattern library for your organization</li>\n<li>Hoping to learn more about design systems because somebody else in your organization is pushing for one</li>\n<li>Having trouble maintaining an existing pattern library</li>\n</ol>\n<p>It <strong>won’t be helpful</strong> for you if you are</p>\n<ol>\n<li>Looking for tips on how to make your interface beautiful</li>\n<li>Seeking hands on information about specific design, CSS or JavaScript techniques</li>\n</ol>\n<p>I enjoyed Atomic Design a lot, and hope that I’ll get to use what I’ve learned in the near future.  As far as I can tell, Atomic design is only available on <a href=\"http://atomicdesign.bradfrost.com/\">Brad Frost’s site</a>.  You can read the book online there, or buy the paperback version.  If you fall into one of the 4 categories I listed above, I’d highly recommend checking it out.</p>","frontmatter":{"title":"Book Review: Atomic Design","keywords":"atomic design systems pattern libraries brad frost","category":"reviews","date":"2018/07/02","path":"/2018/07/02/book-review-atomic-design/","layout":"post","hideFooter":null,"hideSidebar":null},"fields":{"slug":"/2018/07/02/book-review-atomic-design/"}}},"pageContext":{"slug":"/2018/07/02/book-review-atomic-design/","relatedPosts":[{"path":"/2018/02/14/book-review-clean-architecture/","data":{"title":"Book Review: Clean Architecture","path":"/2018/02/14/book-review-clean-architecture/","description":"Uncle Bob's book on architecture is informative, but limits its scope","date":"2018/02/14","category":"reviews"}},{"path":"/2018/06/05/es6-the-bad-parts/","data":{"title":"ES6: The Bad Parts","path":"/2018/06/05/es6-the-bad-parts/","description":"Three years later, what parts of ES6 have I stopped using?","date":"2018/06/05","category":"javascript"}},{"path":"/2018/02/07/react-confessions/","data":{"title":"React Architecture Confessions","path":"/2018/02/07/react-confessions/","description":"The mistakes I made while learning React and why I made them","date":"2018/02/07","category":"fe-architecture"}}]}}