{"data":{"markdownRemark":{"html":"<h3>JavaScript and the Web</h3>\n<p><a href=\"https://medium.com/p/what-is-jsx-310ab98c463e\">What is JSX? | Kent C Dodds</a></p>\n<p>If you were introduced to React “all at once” and didn’t learn it from the basics up, JSX may feel a little bit like magic syntax.  This is a solid explanation of what JSX syntax actually compiles to under the covers.  It demystifies the process and shows that it is all “just JavaScript” in the end.</p>\n<p><a href=\"http://jxnblk.com/writing/posts/defining-component-apis-in-react/\">Defining Component APIs in React | Brent Jackson</a></p>\n<p>Setting up good interface boundaries between your React components is one of the most important steps you can take to make a React application more maintainable.  This is good solid advice, that I wish I’d had when I started building React apps.</p>\n<h3>Business and Leadership</h3>\n<p><a href=\"http://larahogan.github.io/blog/leadership-style-colors/\">Leadership Style Colors | Lara Hogan</a></p>\n<p>Lara has put together a thoughtful article about the different ways that leaders need to be able to relate to others.</p>\n<p><a href=\"https://m.signalvnoise.com/the-open-plan-office-is-a-terrible-horrible-no-good-very-bad-idea-42bd9cd294e3\">The open-plan office is a terrible, horrible, no good, very bad idea | DHH</a></p>\n<p>I appear to be in a weird middle ground where I neither love nor hate open offices.  I don’t think they’re good for my productivity, but I enjoy the people I work with and build more connections with coworkers in an open office than I did when I worked in cubicles. I also find that articles like this tend not to fully grapple with the alternatives.  Most companies aren’t mostly remote like Basecamp, and budgeting private offices for all developers is not realistic (especially for the startups called out in this piece due to unknown scaling needs).  So it’s remote, open office or cubicle farms, and all three have their detractors.</p>\n<h3>Design</h3>\n<p><a href=\"https://uxdesign.cc/designing-for-accessibility-is-not-that-hard-c04cc4779d94\">Designing for accessibility is not that hard | Pablo Stanley</a></p>\n<p>I’m embarrassingly ignorant about accessibility concerns, so this was a helpful article for me.  I’m going to try and walk through some of these steps on this site to help improve my knowledge here.</p>\n<p><a href=\"https://9to5mac.com/2018/07/10/app-store-10-years-design-evolution/\">10 years of the App Store: The design evolution of the earliest apps | 9to5Mac</a></p>\n<p>This was a really fascinating look at how iPhone app designs have shifted over the years.  9to5Mac took 10 popular apps that were there when the App Store first launched 10 years ago (I’ve used 8/10 of these at some point or another) and showed how their UIs and logos had evolved over time.  Interestingly it looks like early 2013, right before the new iOS7 look and feel launched, was the peak point for interface diversity and distinctiveness, as each of these apps had evolved along their own paths.  iOS7 imposed a level of standardization and sameness, and I think apps are just now re-evolving to the point of having truly distinct brand identities on top of that new base.</p>\n<h3>Books</h3>\n<p>I’ve been on vacation this week, so here are 2 quicky non-tech book reviews:</p>\n<p><a href=\"https://amzn.to/2L4uGQp\">Golden Days: West’s Lakers, Steph’s Warriors, and the California Dreamers Who Reinvented Basketball | Jack McCallum</a></p>\n<p>This was a fun book for basketball lovers.  The sections on Jerry West and the Lakers of the 60s and 70s are more detailed and colorful than the alternating chapters on the modern Warriors, but both are fun, and those interested in how modern Silicon Valley has interacted with the rise of the most popular basketball team in the world will find some interesting tidbits in the modern chapters as well.</p>\n<p><a href=\"https://amzn.to/2Jj6vJ2\">American Gods | Neil Gaiman</a></p>\n<p>A fantasy novel set in modern America.  This one was too crude for me to recommend unreservedly, but it contains a huge number of cool images and ideas, and I don’t regret reading it.</p>","frontmatter":{"title":"Weekly Links: July 13th","keywords":"","category":"opinion","date":"2018/07/13","path":"/2018/07/13/weekly-links-07-13-18/","layout":"weekly-links","hideFooter":null},"fields":{"slug":"/2018/07/13/weekly-links-07-13-18/"}}},"pageContext":{"slug":"/2018/07/13/weekly-links-07-13-18/","relatedPosts":[{"path":"/2012/11/09/bayesian-witch-hunt","data":{"title":"Bayesian Witch Hunt","path":"/2012/11/09/bayesian-witch-hunt","description":"A nerd tribute from a friend","date":"2012-11-09T12:00:00+00:00","category":"opinion"}},{"path":"/2012/12/29/i-hate-computing-ecosystems","data":{"title":"I hate computing ecosystems","path":"/2012/12/29/i-hate-computing-ecosystems","description":"Why does nothing work together?","date":"2012-12-29T23:06:00+00:00","category":"opinion"}},{"path":"/2012/12/25/medium-the-end-of-history-and-the-last-website","data":{"title":"Medium: The end of History and the last website","path":"/2012/12/25/medium-the-end-of-history-and-the-last-website","description":"Is there any use in personal websites anymore?","date":"2012-12-25T21:00:00+00:00","category":"opinion"}}]}}