{"data":{"markdownRemark":{"html":"<p>After 3 great days at <a href=\"http://blendconf.com/\">Blendconf</a>, my brain is pretty overloaded with cool ideas. One of the cool things about the conference was seeing certain themes emerge across different sessions.  Here are three of my takeaways from a great weekend.</p>\n<h2>Modular Web Development</h2>\n<p>The biggest technical theme that I noticed in the different sessions I attended was a focus on modular design in JS and CSS. <a href=\"https://twitter.com/shayhowe\">Shay Howe</a> gave a great workshop where he encouraged us to view CSS at a component level rather than at a page level.  That was followed by talks from <a href=\"https://twitter.com/jina\">Jina Bolton</a> and <a href=\"http://wiseheartdesign.com/\">John Long</a>, who reinforced the patterns that Shay had advocated for, and also showed how they could be implemented with preprocessors like SASS. <a href=\"https://twitter.com/vernonk\">Vernon Kesner</a> also gave a great talk on using requireJS for modular Javascript.  That’s a relevant topic to me, since I’ve spent the last 2 months working to convert a large codebase to AMD modules, and Vernon did a great job explaining the motivation for modular JS.</p>\n<h2>Design and Development should not be separate processes</h2>\n<blockquote>\n<p>Design is how it works. — Steve Jobs</p>\n</blockquote>\n<p>One of the real key points that multiple speakers hammered home was the importance of having tightly bound design and development.  <a href=\"https://twitter.com/cameronmoll\">Cameron Moll</a> talked about the importance of really understanding and being true to the things that you’re creating.  <a href=\"https://twitter.com/imathis\">Brandon Mathis</a> argued convincingly that its important for designers to know their material.</p>\n<h2>Leave Things Better Than You Found Them</h2>\n<blockquote>\n<p>Aspire to change your world in some small but significant way —Cameron Moll</p>\n</blockquote>\n<p>I feel like this final point in some ways sums up what BlendConf is all about.  Its the result of <a href=\"https://twitter.com/bermonpainter\">one man</a> thinking about how cool it would be to have a big-time tech conference in Charlotte and then going and making it happen, then going out and finding speakers who set a vision of a tech career that was about more than money.  <a href=\"https://twitter.com/carlsmith\">Carl Smith</a> talked about his quest to find a more humane company structure.  <a href=\"https://twitter.com/ashedryden\">Ashe Dryden</a> encouraged us to look for the people who are being excluded from tech culture and find ways to bring them in. <a href=\"https://twitter.com/greggyb\">Greg Baugues</a> told us about how he’d worked through his bipolar disorder at least partially through the support of his coworkers and friends, while also showing that many people still don’t receive that support. Cameron Moll set the goal as “aspiring to change the world in a small but significant way.”</p>\n<p>Blendconf was the first major tech conference I’ve attended.  I wasn’t totally sure what to expect, but it defied whatever expectations I did have with it’s humanity. I’m excited to see that it is becoming an annual conference, and can’t wait to see where it goes from here.</p>\n<h2>A Great Summary From Twitter</h2>\n<blockquote class=\"twitter-tweet\"><p>The best part of <a\nhref=\"https://twitter.com/blendconf\">@blendconf</a> wasn’t the device\npolicy or the talks, it was the uniformly awesome love and energy from\neveryone there.</p>&mdash; Tim Cheadle (@timcheadle) <a\nhref=\"https://twitter.com/timcheadle/statuses/376491690791817217\">September\n7, 2013</a></blockquote>","frontmatter":{"title":"BlendConf 2013: Takeaways From A Very Human Tech Conference","keywords":null,"category":"software-productivity","date":"2013-09-10T20:00:00+00:00","path":"/2013/09/10/blendconf-2013-takeaways-from-a-very-human-tech-conference","layout":"post","hideFooter":null,"hideSidebar":null},"fields":{"slug":"/2013/09/10/blendconf-2013-takeaways-from-a-very-human-tech-conference"}}},"pageContext":{"slug":"/2013/09/10/blendconf-2013-takeaways-from-a-very-human-tech-conference","relatedPosts":[{"path":"/2013/09/10/blendconf-2013-takeaways-from-a-very-human-tech-conference","data":{"title":"BlendConf 2013: Takeaways From A Very Human Tech Conference","path":"/2013/09/10/blendconf-2013-takeaways-from-a-very-human-tech-conference","description":"My takeaways from BlendConf","date":"2013-09-10T20:00:00+00:00","category":"software-productivity"}},{"path":"/2013/02/03/how-i-work-refactoring","data":{"title":"How I Work:  Refactoring","path":"/2013/02/03/how-i-work-refactoring","description":"Describing the process that goes behind refactoring code","date":"2013-02-03T21:00:00+00:00","category":"software-productivity"}},{"path":"/2016/12/11/readable-code-audience","data":{"title":"Readable code: Know your audience ","path":"/2016/12/11/readable-code-audience","description":"A quick observation about what it means to write readable code","date":"2016-12-12T04:00:00+00:00","category":"software-productivity"}}]}}