{"data":{"markdownRemark":{"html":"<p>In my recent <a href=\"https://benmccormick.org/2019/01/07/the-concerns-of-fe-architecture/\">post on Front End Architecture</a> I identified <strong>Reliability</strong> as one of 6 areas of concern when thinking about front end architecture.  Reliability in this sense can be defined as follows:</p>\n<blockquote>\n<p>An application’s ability to provide a consistent functional experience to all users in the intended audience over time.</p>\n</blockquote>\n<p>Let’s break that down a bit:</p>\n<p><strong>Consistent</strong> - Reliable applications function the same way over time or degrade gracefully, even on days with heavy load, leap years, and weekends.</p>\n<p><strong>Functional</strong> - Reliable applications allow the users to do the things they need to do, and are forgiving when a user attempts actions that weren’t part of an ideal use case.</p>\n<p><strong>All Users In The Intended Audience</strong> - Reliable applications work for users with strange data who live in different locales, and those with bad network connections and old browsers, at least within the limits of what what the business intends to support.  There is some overlap here with the concept of <strong>accessibility</strong>.</p>\n<p><strong>Over Time</strong> - In the real world, no application is ever completely reliable.  Things break down, there are bugs, and new edge cases are discovered.  What we can aspire to though, is an application where things that are working consistently stay working consistently, and as bugs, regressions and edge cases are discovered they get fixed in permanent ways.</p>\n<h3>Things Break Down</h3>\n<p>So why are applications often unreliable?  There are a fairly predictable set of issues that most applications run into that degrade reliability.</p>\n<h4>Unanticipated Usage Patterns</h4>\n<p>Users are agents of chaos.  Oftentimes front end applications perform unreliably because they’re used in ways that nobody expected.  Maybe a developer didn’t expect that anyone would ever try to navigate to a new page in the middle of a file download.  Maybe they didn’t realize that when a button was slow to respond, users would click it repeatedly and eventually spawn enough requests to overload the backend system. Or maybe they didn’t expect anybody to be using an ad blocker when using their site.  Some of these things can be planned for, many will be learned with experience, but there are pretty much always going to be surprises.  Chaos can’t be denied forever.</p>\n<h4>External Failures</h4>\n<p>Google never has bugs right?  So if you’re connecting to a Google API, you can probably count on it always working as expected?  Ah, the naiveté of youth.  All systems break down sometimes.  If you want your system to be robust, it needs to handle failures in any system that it interacts with, whether that’s a Google API, your own backend servers, or a 3rd party script that you’re loading onto the site alongside your app code.  You also need to be prepared for the various capability levels of the different browsers that will run your application, and recognize that not every user will be running the browser you’re developing in.  Or you can trust in Google and await your eventual disappointment.</p>\n<h4>Bugs</h4>\n<h4>Scaling Problems</h4>\n<h3>Keeping Things Running</h3>\n<ol>\n<li>Consider all states (state machine?)</li>\n<li>Don’t trust the network</li>\n<li>Consider variations in data</li>\n<li>Testing</li>\n<li>Monitoring</li>\n</ol>","frontmatter":{"title":"Designing Front End Apps For Reliability","keywords":"","category":"fe-architecture","date":"2019/01/21","path":"2019/01/21/strategic-coding","layout":"post","hideFooter":null,"hideSidebar":null},"fields":{"slug":"2019/01/21/strategic-coding"}}},"pageContext":{"slug":"2019/01/21/strategic-coding","relatedPosts":[{"path":"2019/01/07/the-concerns-of-fe-architecture/","data":{"title":"What is Front End Architecture?","path":"2019/01/07/the-concerns-of-fe-architecture/","description":"6 areas of interest in front end software design discussions","date":"2019/01/07","category":"fe-architecture"}},{"path":"/2018/02/07/react-confessions/","data":{"title":"React Architecture Confessions","path":"/2018/02/07/react-confessions/","description":"The mistakes I made while learning React and why I made them","date":"2018/02/07","category":"fe-architecture"}},{"path":"/2018/08/02/feedback-loops/","data":{"title":"Feedback Loops","path":"/2018/08/02/feedback-loops/","description":"How smaller loops lead to better software","date":"2018/08/02","category":"software-productivity"}}]}}