{"data":{"markdownRemark":{"html":"<p>Performance is a tricky topic to give generalized advice about.  Moreso than any of the other <a href=\"https://benmccormick.org/2019/01/07/the-concerns-of-fe-architecture/\">front end concerns</a> I discussed in my post at the beginning of the year, it is remarkably tied into the details of what an app is doing and how it is built.  That said, here are some general principles for designing performant applications that I’ve picked up over the years:</p>\n<h4>1. Measure First</h4>\n<p>One of the most tempting things with performance is to start making changes before you have a specific slow measurement to improve.  Maybe you’re writing your code up front with a major focus on performance because you know you’ll need it, or diving in to make changes the first time a user complains about slowness.  Regardless it can be tempting to “performance tune” before you get detailed performance measurements.</p>\n<p>This is problematic for 2 reasons: First, we often don’t know what good enough system performance is until users start using the system.  Secondly, programmers’ data-free intuitions on what parts of a system will be slow tend to be universally awful.</p>\n<p>Measuring different aspects of your system first provides several benefits:</p>\n<ol>\n<li>It gives you micro-benchmarks to improve upon, rather than waiting till “it feels good”</li>\n<li>It lets you determine which parts of the system are actually slow, so you can focus on bottlenecks</li>\n<li>It may help you justify performance focused work to project stakeholders.</li>\n<li>It will allow you to test for regressions later on</li>\n<li>It may reveal that the system performance is actually adequate in most situations, and help you narrow down edge cases to optimize or restrict</li>\n</ol>\n<p>Note that this advice encompasses two often quoted pieces of advice: Donald Knuth’s “Premature optimization is the root of all evil” and Kent Beck’s “Make it work, make it right, make it fast”.  When you only optimize based off of measurements, those things are going to naturally fall into place.</p>\n<p>So what should you measure? On the front end Google’s <a href=\"https://developers.google.com/web/fundamentals/performance/rail\">RAIL model</a> is a good place to start.  For loading you can look at benchmarks like first paint, first meaningful paint, and Time To Interactive (TTI) as useful benchmarks. They also provide similar guidance for input responsiveness and animation. Google is a bit preachy about specific perf benchmarks to my mind, but their analysis of <em>what</em> to measure is fantastic.</p>\n<p>It’s also useful to be able to communicate to backend developers when slowness comes from backend requests, so it’s good to familiarize yourself with the network panel in your favorite browser’s developer tools.  That will let you see how long different requests are taking and help evaluate when a performance problem is actually a network problem.</p>\n<h4>2. Assume the network is slow</h4>\n<p>Related to the end of the last point, one of the defining attributes of front end development is that it always involves a network.  You can think of network requests as a giant chaos machine at the heart of your web application.  Network requests will fail, they will be slow… and they’ll almost always look better to you in local development than they will be to your users, assuming like many developers that you’re operating on reasonably good hardware and decent wifi.</p>\n<p>So the network can be a bit of a performance trap for devs.  While I still advocate measuring first, with the network it’s worth assuming that your local setup is not a good proxy for the user and either finding ways to do better tests or simply expecting that the user will have a slower or flakier connection and designing for that.  Firefox and Chrome are very helpful here, as they will allow you to simulate slower connections from within their network panel, allowing you to experience your app the way your users do.  This is especially important if you’re targeting mobile users.</p>\n<h4>3. You can do things more efficiently or you can do less</h4>\n<p>This is ultimately the heart of performance.  When an operation is slow, it is ultimately because your user’s computer is performing too many operations to fit them all into the time you want them to.  To speed things up, you either have to reduce the number of operations by making your code more efficient, or by removing some work completely.  When people talk about compiled languages being faster than non-compiled languages, this is usually what they mean: compilers are very proficient at optimizing code for efficiency and removing wasted operations.</p>\n<p>On the front end there are several major areas of potential waste: we can send too many things over the network, we can cause the browser to repaint or layout thrash unnecessarily, and we can block critical actions like responding to a users input with less critical actions like re-rendering an item offscreen.  Each of those could merit a series of articles on their own, but are great starting points when thinking about how to improve performance when no one component is obviously slow.</p>\n<p>But it is worth remembering that sometime the only way out is doing less. Maybe you need to delay rendering some parts of the screen, or remove an expensive to render visualization. Maybe you should be using built in components instead of shipping a fancy UI component library.  I have no idea what your use case is, but it’s always worth thinking about what you can do less of.</p>\n<h4>4. Perception matters more than reality</h4>\n<p>Engineers like to deal with data and reality.  My first 3 points played right into that.  Now it’s time to go against the grain.  The truth is that users aren’t pulling up devtools to check and see if your site is slow.  It either feels slow to them or it doesn’t.  And the actual numbers are only part of that perception.  Here are some things that can make fast sites seem sluggish and slow sites seem broken:</p>\n<ol>\n<li>\n<p><strong>Not showing a visual response to user interaction</strong></p>\n<p>When a user clicks a button that triggers a network request, and the system does nothing till that request completes, it will lead to the user thinking the system is slow at best and broken at worst.</p>\n</li>\n<li>\n<p><strong>Freezing the interface while waiting on a response to a previous interaction</strong></p>\n<p>It’s always important to keep the screen interactive while waiting on a request, even if some options are disabled or limited.  The user should be able to access navigation and other standard elements of the interface as normal.  In a scenario where the request is saving data, it may be necessary to add prompts to check whether they want to interrupt the save however.</p>\n</li>\n<li>\n<p><strong>Loading states without any movement or animation</strong></p>\n<p>Sometimes people just want to know that you’re doing something.  Animation communicates that something is happening.  It can be a spinner, a flowing placeholder block, or a progress bar.  The important thing is to show the user “things are happening”.  Of course the more relevant your loading state is the better.  Facebook’s placeholder items in their newsfeed create an illusion of content coming in even faster since the loading state itself helps frame the screen for the user.  Much more effective than a loading spinner that serves to remind the user that they’re having to wait for something.</p>\n</li>\n</ol>\n<h3>Performance Is All About Effort</h3>\n<p>To quote <a href=\"https://hackernoon.com/10-things-i-learned-making-the-fastest-site-in-the-world-18a0e1cdf4a7\">David Gilbertson’s great post on performance</a>:</p>\n<blockquote>\n<p>It’s really easy to make a slow site, all you have to do is not try to make a fast one.</p>\n</blockquote>\n<p>Performance comes down to caring, measuring and investing.  If you set reasonable benchmarks, and track them as you make changes, you’re likely to find ways to achieve them.  If you set unreasonable benchmarks and make the space to work at them, you’re likely to do better than anyone who isn’t trying that hard would expect.</p>\n<p><strong>TL;DR</strong></p>\n<ul>\n<li><strong>Measure First</strong></li>\n<li><strong>Assume The Network is Slow</strong></li>\n<li><strong>You can do things more efficiently or you can do less</strong></li>\n<li><strong>Perception > Reality</strong></li>\n<li><strong>Performance is all about effort</strong></li>\n</ul>","frontmatter":{"title":"Designing Front End Apps For Performance","keywords":"","category":"fe-architecture","date":"2019/01/28","path":"/2019/01/28/designing-for-perf","layout":"post","hideFooter":null,"hideSidebar":null},"fields":{"slug":"/2019/01/28/designing-for-perf"}}},"pageContext":{"slug":"/2019/01/28/designing-for-perf","relatedPosts":[{"path":"/2019/01/21/designing-for-reliability","data":{"title":"Designing Front End Apps For Reliability","path":"/2019/01/21/designing-for-reliability","description":"Principles for creating more robust applications","date":"2019/01/21","category":"fe-architecture"}},{"path":"/2019/01/07/the-concerns-of-fe-architecture/","data":{"title":"What's involved in Front End Architecture?","path":"/2019/01/07/the-concerns-of-fe-architecture/","description":"6 areas of interest in front end software design discussions","date":"2019/01/07","category":"fe-architecture"}},{"path":"/2019/01/14/value-from-code-reviews","data":{"title":"6 Keys To Valuable Code Reviews","path":"/2019/01/14/value-from-code-reviews","description":"Getting the most out of your code review process","date":"2019/01/14","category":"software-productivity"}}]}}