{"data":{"markdownRemark":{"html":"<p>I’m trying something different today.  This is a review of 2 books I’ve read recently; I’m combining them because their similarities and differences are just as interesting to me as the practical steps they encourage.</p>\n<p><a href=\"https://amzn.to/2TqwDeR\">Deep Work</a> is a 3 year old book from Cal Newport focused on encouraging readers to spend more time on their most important work.  It starts out with sections defining and motivating “Deep Work”: focusing without distraction on cognitively demanding tasks.  Then it goes on to give a series of recommended strategies for creating more and better deep work time in your life.</p>\n<p><a href=\"https://amzn.to/2F0AIgV\">The Common Rule</a> is a new book by Justin Earley focused on building habits that allow living life with purpose.  It is a “Christian book”, and recommends practices like daily prayer and fasting.  But it is mainly focused on encouraging habits to combat some universal challenges of modern American life: distracting technologies, all consuming work environments, and increasing isolation.</p>\n<h3>A Shared Diagnosis</h3>\n<p>Deep Work and The Common Rule share a common view on the challenges facing many American adults today: they each tackle tech distractions, work expectations of constant availability, and time spent on shallow activities disconnected from our core goals and desires.</p>\n<p>Both authors are skeptical of modern “networking tools” like social networks, chat tools, news sites and email without dismissing them.  The primary issue both authors identify as the problem with technology is our non-critical acceptance of new tools into our lives as progress, the addictive nature of these services, and how they then impact our brains. Because we turn to technology for distraction and easy comfort whenever we’re bored, we lose our capacity for deeper engagement with the world and can lose sight of more important things.</p>\n<p>Each book also decries the problems with “constant connectivity culture”.  Deep Work comes at it from a pure productivity standpoint: expectations of constant availability create distractions that prevent us from getting into the flow of meaningful work, and when we’re answering emails at all hours of the day, we don’t get the context shifts where our brains can rest and help us be more productive later.  The Common Rule shares these concerns but is more interested in how these distractions can shape our thinking and emotions: when we get sucked into the world of social media news for instance, is the anger we feel about issues a reflection of our true priorities or a path that we’ve fallen down.  It also asks us to consider how long term media-consumption may shape these believes and not just distract from them.</p>\n<p>Finally, both authors touch on the amount of time we spend on meaningless activities.  Whether it is busy work, meetings, social media usage we feel we “have to do” or “real work” that just isn’t the most important work, both books encourage readers to value their time and be strategic about how to spend it.  They share a rare humble view of the human condition: we really do need to work with only 24 hours a day.  How to “make the most of them” is a core focus of each book.</p>\n<h3>A Suprisingly Similar Recommendation</h3>\n<p>In addition to a shared view of the problems people face, both books share a fairly similar approach to solving them.  Both books recommend ritualized structuring of life to reduce time spent on shallow, distracting activities and enable time for “the good life”.</p>\n<p>So… what is “ritualized structuring”?  Both books spend significant time outlying a series of recommended habits/rituals that combine to help make us more aware of how our time is spent, and also serve as enabling spaces for “the good life”.  Deep work recommends (among other things) structured work hours, work-free evenings, social media avoidance and end of the day “shutdown rituals” where you clean up todos and make a schedule for the next day.  The Common Rule advocates for taking an hour away from your phone each day, a meal with others each day, curating media to 4 hours each week as well as more obviously religious habits like daily prayer and a sabbath day.</p>\n<p>Each book offers these habits as “focusing tools”, ways to spend time on what is important and focus on the “good life”.  So what is the “good life”? Well…</p>\n<h3>A Subtly Different Motivation</h3>\n<p>The biggest difference between Deep Work and The Common Rule is what they’re aiming to enable.  What is the “good life” that we want to unlock as we wade out of the shallows?</p>\n<p>Deep Work sees “Deep Work” as both a good in itself and a means to career success.  Deep Work allows for craftsmanship and an impact on the world greater than we’re normally able to achieve.  And because it is both important and implicitly discouraged by the modern office environment, clearing space for it is a tremendous competitive advantage when it comes to career success.</p>\n<p>The Common Rule is explicitly focused on habits that turn us outward from ourselves; habits like a daily meal with others and a weekly hour of conversation with a friend are about connecting with the people around us, while daily prayer and weekly fasting are about connecting with God.  And ultimately they’re about health: when we connect well with God and others, we’re able to live in a way where we can accept our limitations and thrive where we are.</p>\n<p>I don’t think the 2 philosophies are incompatible per say: you can work efficiently at work while valuing your relationships, as long as you’re willing to accept the inherent limitations of the 24 hour day.  But reading these 2 books back to back reminded me that “efficiency” is never an end to itself.  It’s always important to make sure you’re heading efficiently in the right direction.</p>\n<h3>Recommendation</h3>\n<p>I highly recommend both of these books.  They are full of fantastic suggestions that I plan on implementing over time (I’m trying to avoid my classic blunder of trying to change everything about my life at once and look for bits and pieces to attempt first). But as you take in the ideas, make sure to reflect on what the “good life” looks like to you.</p>\n<h4>Amazon Links</h4>\n<ul>\n<li><a href=\"https://amzn.to/2TqwDeR\">Deep Work by Cal Newport</a></li>\n<li><a href=\"https://amzn.to/2F0AIgV\">The Common Rule by Justin Earley</a></li>\n</ul>","frontmatter":{"title":"Book Review: Deep Work & The Common Rule","keywords":"deep work ritual","category":"reviews","date":"2019/03/09","path":"/2019/03/09/book-review-deep-work-common-rule","layout":"review","hideFooter":null,"hideSidebar":null},"fields":{"slug":"/2019/03/09/book-review-deep-work-common-rule"}}},"pageContext":{"slug":"/2019/03/09/book-review-deep-work-common-rule","relatedPosts":[{"path":"/2018/12/31/book-review-philosophy-of-software-design/","data":{"title":"Book Review: A Philosophy of Software Design","path":"/2018/12/31/book-review-philosophy-of-software-design/","description":"John Ousterhout's book is a solid intermediate book on the art of writing software","date":"2018/12/31","category":"reviews"}},{"path":"/2019/01/01/book-review-radical-candor","data":{"title":"Book Review: Radical Candor","path":"/2019/01/01/book-review-radical-candor","description":"The best book I read in 2018","date":"2019/01/01","category":"reviews"}}]}}