{"data":{"markdownRemark":{"html":"<p>I saw a tweet thread a few weeks ago that made me think:</p>\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">There’s a bit of a meme in some parts that there is value in saying, out loud, “I realize that I am surprised.” For similar reasons, I often subvocalize “I believe I now understand the type of situation the ‘trivial’ advice was preparing me for.” <a href=\"https://t.co/JzdYmSvJWH\">https://t.co/JzdYmSvJWH</a></p>&mdash; Patrick McKenzie (@patio11) <a href=\"https://twitter.com/patio11/status/1115751939210223616?ref_src=twsrc%5Etfw\">April 9, 2019</a></blockquote>\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">And then you repeat it to someone and they say “lol that is obvious” and you wonder if you know the advice well enough yet to correct them on how not obvious it is going to be for their next 10 years.</p>&mdash; Patrick McKenzie (@patio11) <a href=\"https://twitter.com/patio11/status/1115752453910061056?ref_src=twsrc%5Etfw\">April 9, 2019</a></blockquote>\n<p>I realized that I’ve encountered plenty of pieces of wisdom in my software career that have this property; I see them as clear and obvious when put in the abstract, but only learn to actually apply them by repeatedly failing to do so.  This is what people talk about when they say something is “hard earned experience” I guess.</p>\n<p>Here are some examples from my career:</p>\n<ol>\n<li><strong>In the long run, rate of improvement (or regression) matters more than current level</strong> - This has applications in hiring, code quality, and finding/staying in a job.  But it’s often easier to observe how good something is now than to see how its changing, and I often fail to properly estimate what a trend means for a situation 1-3 years down the road.  It’s also easy to mis-apply this principle when you for get about the “long run” part.  A new employee with tons of potential won’t help you when you need an experienced hand <em>now</em> and fixing technical debt can easily cost you your ability to hit a quarterly objective.  Knowing how to balance these long and short term goals is something I still struggle with all the time.</li>\n<li><strong>Rewriting from scratch is (almost) never worth it</strong> - <a href=\"https://www.joelonsoftware.com/2000/04/06/things-you-should-never-do-part-i/\">Joel Spoelsky</a> wrote about this way back in 2000 and I remember reading that article nearly a decade ago and nodding along.  I seem to have infinite capacity to convince myself that my current situation fits in those parentheses though.  In my career this has mostly been a problem where I’m able to more accurately forecast the pain that would ensue from fixing what exists (because that code exists and is easier to work with), while I appear to systematically underestimate the pain of building the new thing (because the internet told me it would be great, and the code doesn’t exist for me to nitpick yet).</li>\n<li><strong>Always consider multiple options</strong> - Pretty much any decision (technical or otherwise) benefits from having multiple contenders.  This seems obvious.  But I have often let myself fall into situations where I’m choosing between just 2 options, or really just choosing whether or not to do 1 thing.  This has applications in technology choices, job choices, responding to another person’s provocations, and more.  I intuitively know that more options are good, and I constantly miss opportunities to add options.</li>\n</ol>\n<p>So how do we improve on these situations where we fail to apply <em>obvious</em> wisdom?  I’ve been learning a few things lately.</p>\n<ol>\n<li><strong>Always review what you’ve done on a regular basis</strong> - Do weekly reviews about how your week went.  Do quarterly reviews with yourself about how your job is going.  When you make big decisions, make sure to find a time to check back in later and evaluate how it went.  We make better decisions when we take the time to measure our results</li>\n<li><strong>Note Missed Opportunities</strong> - When you do those reviews, make sure to pay attention to when you missed an opportunity to apply something you <em>knew</em>.  Sometimes we make mistakes because we just didn’t know something.  It’s more common though that we didn’t properly apply our own principles and knowledge.</li>\n<li><strong>Identify Cues</strong> - Identify the thing that you know you’re going to have to handle different next time.  Maybe you say “if I’m looking for a job, I should consider at least 4 or 5 different companies and not focus in on just one”, or if I’m asked to fix a legacy codebase, I will spend at least 3 months trying to improve it before considering a re-write,and I’ll look for real world comparisons to base a rewrite estimate on”.  Whatever it is for you, when you can identify situations where a specific action should take place, it can help you be better the next time instead of repeating the same old mistakes.</li>\n</ol>","frontmatter":{"title":"Obvious Things","keywords":"","category":"soft-skills","date":"2019/05/18","path":"/2019/05/18/obvious-things","layout":"post","hideFooter":null,"hideSidebar":null},"fields":{"slug":"/2019/05/18/obvious-things"}}},"pageContext":{"slug":"/2019/05/18/obvious-things","relatedPosts":[{"path":"/2019/04/15/soft-skills","data":{"title":"Ten Soft Skills That Will Shape Your Career","path":"/2019/04/15/soft-skills","description":"The other 80% of career skills.","date":"2019/04/15","category":"soft-skills"}},{"path":"/2019/01/07/the-concerns-of-fe-architecture/","data":{"title":"What's involved in Front End Architecture?","path":"/2019/01/07/the-concerns-of-fe-architecture/","description":"6 areas of interest in front end software design discussions","date":"2019/01/07","category":"fe-architecture"}},{"path":"/2018/02/07/react-confessions/","data":{"title":"React Architecture Confessions","path":"/2018/02/07/react-confessions/","description":"The mistakes I made while learning React and why I made them","date":"2018/02/07","category":"fe-architecture"}}]}}