{"data":{"markdownRemark":{"html":"<h3>JavaScript &#x26; The Web</h3>\n<p><a href=\"https://www.gatsbyjs.org/blog/2018-06-16-announcing-gatsby-v2-beta-launch/\">Announcing Gatsby v2 beta launch! | GatsbyJS</a></p>\n<p>Gatsby continues to be one of the most exciting things happening in web development.  If you’re unfamiliar, Gatsby is a tool for building performant content-focused sites with React and GraphQL.  This blog has been built on it for the last 18 months or so.  Updating to V2 is pretty straightforward, I’ve been running it on here for the past week with no problems.  And V2 offers some nice improvements in terms of hot loading speed, library updates (it’s React 16, Babel 7 and Webpack 4 friendly) and API improvements.  It’s also obvious that since they <a href=\"https://benmccormick.org/2018/05/27/weekly-links-05-27-18/\">announced that Gatsby contributors were forming a company</a> the docs and marketing materials have been quickly moving from “indy open source” level to “real company” level, which is cool to see.</p>\n<h3>Programming Practices</h3>\n<p><a href=\"http://laputan.org/mud/\">Big Ball of Mud |  Brian Foote and Joseph Yoder </a></p>\n<p>This is an older piece (1999), but a cool reflection on “Big Balls of Mud”: computer systems that have been designed haphazardly and are now difficult to change.  Besides giving these systems a great name, Foote and Yoder are thoughtful about why these systems come to be, and how and when that may be appropriate.</p>\n<p><a href=\"https://amasad.me/intuition\">Overcoming Intuition in Programming</a></p>\n<p>Some interesting reflections here on how we use frameworks to reduce the cognitively challenging parts of programming.  I can definitely recall feeling less useful outside of my comfort zone when I’ve spent too much time working with “intuitive” code.</p>\n<h3>Books</h3>\n<p><a href=\"https://leanpub.com/javascriptallongesix/read\">JavaScript Allongé | Reg Braithwaite</a></p>\n<p>I realized the other day that I had never written a review of one of my favorite JavaScript books on this site.  This won’t count as a full review, but suffice it to say that if you’re interested in functional programming, want to get a deeper understanding of JavaScript, or really like JavaScript <strong>and</strong> coffee, this is the book for you.</p>\n<p><a href=\"https://amzn.to/2MiGMSV\">On Writing Well | William Zinsser</a></p>\n<p>Over the past year, I’ve been going through a challenge to read 30 books in a year.  I am well aware of my limitations as a writer, so one of the books I added to the list was “On Writing Well”, recommended from multiple sources as the best resource for non-fiction writing.</p>\n<p>Reading a 42 year old book<sup id=\"fnref-1\"><a href=\"#fn-1\" class=\"footnote-ref\">1</a></sup> about writing is a nice view into what has changed over the last half century and what hasn’t.  The basic principles the book lays out are as applicable as ever, however its specific examples often feel a bit dated.  It lacks any direct instruction about the type of writing that now happens in emails, slack and social media<sup id=\"fnref-2\"><a href=\"#fn-2\" class=\"footnote-ref\">2</a></sup>, but it pointed me back to a time where our public writing was created with more care and resulted in more eloquence than you usually find in today’s frenzied discourse.  Parts of the book felt dated to me, but there was plenty of practical advice to glean, and even more sections I found inspiring.  I finished up wanting my writing to be better and had some practical ideas about how to make that happen.  And I learned a little bit about painting birds and the salt caravans of the Sahara along the way.  What more can you ask for?</p>\n<div class=\"footnotes\">\n<hr>\n<ol>\n<li id=\"fn-1\">\n<p>It was last updated in 2006, so it’s not completely that old.</p>\n<a href=\"#fnref-1\" class=\"footnote-backref\">↩</a>\n</li>\n<li id=\"fn-2\">\n<p>There is a great opportunity sitting out there for somebody to write the definitive book on modern business writing skills.</p>\n<a href=\"#fnref-2\" class=\"footnote-backref\">↩</a>\n</li>\n</ol>\n</div>","frontmatter":{"title":"Weekly Links: June 23rd","keywords":"gatsby","category":"opinion","date":"2018/06/23","path":"/2018/06/23/weekly-links-06-23-18/","layout":"weekly-links","hideFooter":null,"hideSidebar":null},"fields":{"slug":"/2018/06/23/weekly-links-06-23-18/"}}},"pageContext":{"slug":"/2018/06/23/weekly-links-06-23-18/","relatedPosts":[{"path":"/2012/11/09/bayesian-witch-hunt","data":{"title":"Bayesian Witch Hunt","path":"/2012/11/09/bayesian-witch-hunt","description":"A nerd tribute from a friend","date":"2012-11-09T12:00:00+00:00","category":"opinion"}},{"path":"/2012/09/19/the-iphone-5-conversation-so-far","data":{"title":"The iPhone 5 Conversation so Far","path":"/2012/09/19/the-iphone-5-conversation-so-far","description":"The same conversation just keeps happening","date":"2012-09-19T11:00:00+00:00","category":"opinion"}},{"path":"/2013/06/09/90-done-halfway-there","data":{"title":"90% Done, Halfway There","path":"/2013/06/09/90-done-halfway-there","description":"A post on the difficulties of estimating development projects","date":"2013-06-09T18:45:00+00:00","category":"opinion"}}]}}