{"data":{"markdownRemark":{"html":"<p>Stop me if this sounds familiar: you see a bug on your site.  You want to know what’s going on.  You fire up the developer tools, put a breakpoint in the area you think is a problem, and… the error doesn’t occur while it’s being debugged.  Probably it’s a timing issue, but I’ve also seen situations where pausing on certain breakpoints will actually cause a browser tab to freeze up.  Whatever weirdness you’re dealing with, you can’t get a breakpoint running in the right spot to see the error.  These are known colloquially as <a href=\"https://en.wikipedia.org/wiki/Heisenbug\">Heisenbugs</a>, bugs that disappear when measured.  Ideally at this point you would add some logging, but if the issue is on production, and you don’t know exactly what needs to be logged, that could delay a fix by an unacceptable amount.</p>\n<p>I actually ran into this last night, and decided to test out a tactic I’d heard about in a <a href=\"https://changelog.com/jsparty/30\">recent JS Party episode</a>.  Did you know that you can use conditional break points to add temporary logging to a live application?</p>\n<p>Conditional breakpoints are a browser debugger feature where you set a breakpoint, and specify a condition.  The breakpoint only stops the program execution when that condition is truthy.  Here’s a video describing the feature in Firefox:</p>\n<div>\n          <div\n            class=\"gatsby-resp-iframe-wrapper\"\n            style=\"padding-bottom: 56.25%; position: relative; height: 0; overflow: hidden;\"\n          >\n            <iframe src=\"https://www.youtube.com/embed/pVPlMhfrMwM\" frameborder=\"0\" encrypted-media\" allowfullscreen style=\"\n            position: absolute;\n            top: 0;\n            left: 0;\n            width: 100%;\n            height: 100%;\n          \"></iframe>\n          </div>\n          </div>\n<p>Conditional breakpoints are useful when you’re running through a code path many times during program execution, but you want to stop during a specific run.  But they can also be used to solve our heisenbug problem.  Because the conditional breakpoint executes the code inside of it in the context of the line we’re trying to break on, we can actually put logging inside the breakpoint.</p>\n<p><a href=\"log-example.png\">An example of a console.log inside a breakpoint</a></p>\n<p>That <code class=\"language-text\">console.log</code> will execute, and because <code class=\"language-text\">console.log</code> returns false, the breakpoint will never actually stop.  It’s a heisenbug-safe version of watching variables when you’re at a breakpoint, and there’s no redeploys required.</p>\n<p><strong>Update January 2019: Chrome will soon be building this hack right into the devtools with a new “logpoint” option for breakpoints that formalizes this method.  Very cool!</strong></p>\n<blockquote class=\"twitter-tweet\" data-lang=\"en\"><p lang=\"en\" dir=\"ltr\">New feature in Chrome 73: Logpoints. Log messages to the Console without cluttering up your code with console.log() calls. <a href=\"https://t.co/aFl2e6GmnF\">https://t.co/aFl2e6GmnF</a> <a href=\"https://t.co/fJ6CUNN0Lg\">https://t.co/fJ6CUNN0Lg</a></p>&mdash; Chrome DevTools (@ChromeDevTools) <a href=\"https://twitter.com/ChromeDevTools/status/1088463799886200832?ref_src=twsrc%5Etfw\">January 24, 2019</a></blockquote>","frontmatter":{"title":"Quick Tip: Logging In Breakpoints","keywords":"debugging, console.log, jsparty","category":"platform","date":"2018/07/17","path":"/2018/07/17/quick-tip-logging-breakpoints/","layout":"post","hideFooter":null,"hideSidebar":null},"fields":{"slug":"/2018/07/17/quick-tip-logging-breakpoints/"}}},"pageContext":{"slug":"/2018/07/17/quick-tip-logging-breakpoints/","relatedPosts":[{"path":"/2018/07/04/evil-javascript/","data":{"title":"Evil JavaScript","path":"/2018/07/04/evil-javascript/","description":"The code you write when you don't care about people","date":"2018/07/04","category":"javascript"}},{"path":"/2018/06/26/javascript-stale-practices/","data":{"title":"JavaScript “Stale Practices”","path":"/2018/06/26/javascript-stale-practices/","description":"Looking at a few previous JavaScript best practices that are now out of date.","date":"2018/06/26","category":"javascript"}},{"path":"/2017/07/19/ten-things-javascript/","data":{"title":"Ten Things A Serious JavaScript Developer Should Learn","path":"/2017/07/19/ten-things-javascript/","description":"Some of the important things to pick up in the JS world","date":"2017-07-19T04:00:00+00:00","category":"javascript"}}]}}