{"data":{"markdownRemark":{"html":"<p>In honor of Thanksgiving this week, instead of a list of writing from around the web, this week I’ll be linking to some of my favorite lesser known software tools, apps and gear.  These are things that let me get things done, and I’m thankful for that.</p>\n<h3>JavaScript Libraries</h3>\n<p><a href=\"https://www.gatsbyjs.org/\">Gatsby</a> - I’ve written and spoken about Gatsby before, but it keeps getting better as a tool for building React-based web sites and applications.  This blog is written using it.</p>\n<p><a href=\"https://date-fns.org/\">date-fns</a> - date-fns is a nice modular lightweight alternative to <a href=\"https://momentjs.com/\">moment.js</a> for date management in JavaScript.  Because JavaScript’s built in dates are weird and hard to work with, and not everybody needs all of the goodness moment provides.</p>\n<p><a href=\"https://mobx.js.org/\">MobX</a> - It’s been overshadowed by Redux, but MobX is a fantastic state management library for JavaScript libraries.  Since its an object oriented model that can be used in a variety of ways, it is easier to pull in incrementally</p>\n<p><a href=\"https://glamorous.rocks/\">glamorous</a> - My favorite CSS-in-JS library for React, it lets you write styles in a few different ways, which allows you to manage things in a very React-y way, without ever getting stuck with things you can’t do.</p>\n<h3>Apps</h3>\n<p><a href=\"https://flexibits.com/fantastical\">Fantastical</a> - The best app I’ve ever used for OSX and iPhone</p>\n<p><a href=\"https://mailplaneapp.com/\">Mailplane</a> - If you like GMail’s web app (obviously not to everyone’s taste) Mailplane is a great way to use it as a native app on OSX.  I like it because it allows me to use both of my Gmail accounts side by side with their own notification settings and no risk of being lost in a sea of browser tabs.</p>\n<h3>Gear</h3>\n<p><a href=\"http://www.rickshawbags.com/commuter-laptop-bag\">Rickshaw Bagworks Commuter Bag</a> - I’ve had the 2.0 version of this bag for the past 4 years, and it has been an amazingly versatile and durable tool for transporting my laptops, notebooks and more.  Highly recommended.</p>\n<p><a href=\"https://store.google.com/product/chromecast_2015\">Chromecast</a> - I have a Chromecast and a Chromecast audio, and they’re an amazing cheap way to turn TVs and speakers into “Smart devices” that you can control from your phone without having to pay for “smart devices” that probably won’t be kept up to date the way you’d want.</p>\n<p><a href=\"http://amzn.to/2zpBZcm\">Backbeat Fit</a> - I’ve now ended up buying 4 pairs of these headphones for myself and others.  They’re fantastic versatile headphones that work great for exercise headphones but are good enough quality to use for other purposes.  I personally have trouble with ear-buds (they don’t stay in my ears), so the over-ear style of the fit is perfect for me.</p>","frontmatter":{"title":"Weekly Links: Thanksgiving 2017 edition","keywords":"gatsby date-fns mobx glamorous","category":"opinion","date":"2017/11/26","path":"/2017/11/26/weekly-links-11-26-17/","layout":"weekly-links","hideFooter":null},"fields":{"slug":"/2017/11/26/weekly-links-11-26-17/"}}},"pageContext":{"slug":"/2017/11/26/weekly-links-11-26-17/","relatedPosts":[{"path":"/2012/12/25/medium-the-end-of-history-and-the-last-website","data":{"title":"Medium: The end of History and the last website","path":"/2012/12/25/medium-the-end-of-history-and-the-last-website","description":"Is there any use in personal websites anymore?","date":"2012-12-25T21:00:00+00:00","category":"opinion"}},{"path":"/2012/09/19/the-iphone-5-conversation-so-far","data":{"title":"The iPhone 5 Conversation so Far","path":"/2012/09/19/the-iphone-5-conversation-so-far","description":"The same conversation just keeps happening","date":"2012-09-19T11:00:00+00:00","category":"opinion"}},{"path":"/2013/06/09/90-done-halfway-there","data":{"title":"90% Done, Halfway There","path":"/2013/06/09/90-done-halfway-there","description":"A post on the difficulties of estimating development projects","date":"2013-06-09T18:45:00+00:00","category":"opinion"}}]}}