{"data":{"markdownRemark":{"html":"<p>I recently read <a href=\"https://amzn.to/2Elk5g8\">A Philosophy Of Software Design</a> by John Ousterhout.  In an early chapter he paints a picture of a “tactical tornado” programmer, a programmer who is always focused on solving the current problem by the most expedient method possible, with no thought to the long term implications.  I suspect anyone with even a few years in the programming has seen programmers like this, and has also from time to time written “tactical” code like this themselves.  Ousterhout’s recommendation is instead to write code strategically rather than tactically, taking more up front time to plan the structure for the benefit of longer term productivity.</p>\n<p>Ousterhout focuses his examination of tactical vs strategic coding on the issue of complexity.  Complexity as he defines it is anything that makes the system difficult to work with.  It is the root issue behind much of the <em>ease of change</em> concern I identified in my <a href=\"https://benmccormick.org/2019/01/07/the-concerns-of-fe-architecture/\">recent post</a>.  But we can expand this to encompass all of the front end concerns.  We can easily impact reliability, performance, ease of change, accessibility, security and capability when we make short hand tradeoffs.</p>\n<p>Let’s consider the problem of getting a new sign up page set up for a site.  There are several different approaches we could take.  By far the simplest is a basic HTML page using normal CSS and little or no JavaScript, that posts to a backend service after the signup and then redirects to a different static page.  We could set this up on S3 or any other service that will host static files.  On the other extreme, we could set up a new server side rendered Typescript-based React application that uses Next.js to give us server side rendering, which we deploy using Docker and a fully automated CI build system with chatbot ops.  Which one of these approaches is better?</p>\n<p>A tactical tornado would likely prefer the first solution.  They could get the whole thing up and running in an hour, stamp it and call it done.  Other developers might be attracted to the <em>cool</em> approach and want to avoid the “outdated” approach.  But we can only really answer the question by stepping back and asking some questions:</p>\n<ul>\n<li>What is the future of this application?  Is this a standalone page, or the first page in a larger application?</li>\n<li>What feature requests are we likely to get for the page?  Is it probable that we’ll eventually need form validation, dynamic success and failure states, complex behavior that depends on the use case?</li>\n<li>What browsers are we supporting</li>\n<li>What are our performance benchmarks?</li>\n</ul>\n<p>Questions like that can tell us when we’ll benefit from an up front investment in certain areas, and when it’s wiser to be quick and dirty.  They also allow us to evaluate whether any options we’re considering might cut us off from achieving long term goals.  For instance, if we know that we’ll eventually need to scale this site into a large application with responsive interactions, personalized content and information maintained between page loads, building this out as a series of static pages which POST to a backend would eventually limit our capabilities or require a refactor.  But if this is only a one-off landing page for an event happening next week that won’t be maintained beyond that point, developing a long-term maintenance strategy would be wasted effort.  This is <em>strategic coding</em>, and it doesn’t stop at the beginning of a project, it’s an ongoing mindset that you can take as you add each new feature to an application.</p>\n<p>Ousterhout makes a case that aligns with my experience, that strategic programming is a long term winner.  I’ve seen that over time improvements to ease of change will often help a team save time lost, significant hits to performance, security, reliability may hurt them more than a fast solution saves them, and solutions that unreasonably limit us in terms of system capability or accessibility will ultimately get rejected.  The weasel words there exist for a reason… sometimes it really is the best idea to just get something working.  But a strategic programmer will understand the context of their project, and make wise choices about where and how to invest in the codebase.</p>\n<p><strong>TL;DR</strong></p>\n<ul>\n<li><strong>It is possible to program either tactically or strategically</strong></li>\n<li><strong>Tactical programming is focused on solving the immediate problem as quickly as possible</strong></li>\n<li><strong>Strategic coding considers the context of the problem, and any architectural concerns involved in a change</strong></li>\n<li><strong>Strategic coding doesn’t mean never hacking and always investing, it means letting context inform the amount and direction of investment in a codebase</strong></li>\n</ul>\n<p>PS: I put a <a href=\"https://benmccormick.org/2018/12/31/book-review-philosophy-of-software-design/\">full review of A Philosophy of Software Design</a> up on the site a few weeks ago.  Check it out :)</p>","frontmatter":{"title":"Strategic Coding","keywords":"","category":"fe-architecture","date":"2019/02/18","path":"/2019/02/18/strategic-coding","layout":"post","hideFooter":null,"hideSidebar":null},"fields":{"slug":"/2019/02/18/strategic-coding"}}},"pageContext":{"slug":"/2019/02/18/strategic-coding","relatedPosts":[{"path":"/2018/12/31/book-review-philosophy-of-software-design/","data":{"title":"Book Review: A Philosophy of Software Design","path":"/2018/12/31/book-review-philosophy-of-software-design/","description":"John Ousterhout's book is a solid intermediate book on the art of writing software","date":"2018/12/31","category":"reviews"}},{"path":"/2019/01/07/the-concerns-of-fe-architecture/","data":{"title":"What's involved in Front End Architecture?","path":"/2019/01/07/the-concerns-of-fe-architecture/","description":"6 areas of interest in front end software design discussions","date":"2019/01/07","category":"fe-architecture"}},{"path":"/2018/08/02/feedback-loops/","data":{"title":"Feedback Loops","path":"/2018/08/02/feedback-loops/","description":"How smaller loops lead to better software","date":"2018/08/02","category":"soft-skills"}}]}}