{"data":{"markdownRemark":{"html":"<p>If you have any interest at all in data visualization, you can’t get very far learning about it without hearing the name Edward Tufte.  His four books on the subjects have had a huge influence on the industry over the last 35 years, a time where data visualization has blossomed as it has moved from a tedious hand drawn task to a computer assisted activity that even middle schoolers can attempt with the software available on most laptops.</p>\n<p>Tufte’s first book, <a href=\"http://amzn.to/2H6EB2f\">The Visual Display of Quantitative Information</a> is also his most well known and acclaimed book<sup id=\"fnref-1\"><a href=\"#fn-1\" class=\"footnote-ref\">1</a></sup>.  It lays out many of the principles that he would go to expand on elsewhere:</p>\n<ul>\n<li>Focus on the data</li>\n<li>“Graphical excellence is that which gives to the viewer the greatest number of ideas in the shortest time with the least ink in the smallest space”</li>\n<li>Graphics should have <em>integrity</em>.  They shouldn’t mislead the reader.</li>\n<li>Remove unecessary clutter</li>\n<li><em>and more</em></li>\n</ul>\n<p>The book is also beautiful.  Tufte chose to self-publish it so that he could control the exact layout and typography.  He also mixes in many old hand drawn visualizations to mix with a fewer new computer assisted graphics.  The result is stunning, and makes for a very enjoyable read throughout, as there is always something interesting to look at.  </p>\n<p><img src=\"typical_page.jpg\" alt=\"A typical page\"></p>\n<p>I was pleased to find that the book didn’t back up some of my own pre-conceived notions about Tufte and his work.  When I’ve seen him referenced in the past, it has been almost solely in terms of minimalism.  He was an expert witness for fewer colors, fewer lines, less ink.  But his takes here are more nuanced.  He definitely tends towards minimalism, and argues for reducing graphs to their bare minimum ink amount over conforming to familiar forms<sup id=\"fnref-2\"><a href=\"#fn-2\" class=\"footnote-ref\">2</a></sup>.  But his go to example of great data display throughout the book is hardly minimalist.  Minard’s map of Napoleon invading Russia is a complex visualization that tracks the size of an army, time, location and temperature, all in a single image.</p>\n<p><img src=\"minards-map.png\" alt=\"Minards Map of Napoleon Invading Russia\"></p>\n<p>Instead Tufte is really arguing for data efficiency.  Simple things should be displayed simply.  If you have a single number, don’t dress it up in a fancy graph.  Just show the number.  If you have a series of numbers, a table or simple scatter will work fine, no need for a fancy piece of chart “art”.  But when you have truly complex data, a complex visualization can make it accessible in ways that a large page of words and numbers never could on its own.</p>\n<p>I found <a href=\"http://amzn.to/2H6EB2f\">The Visual Display of Quantitative Information</a> fun, informative and inspirational.  If you work with data and have never read it, I’d definitely recommend checking it out.</p>\n<div class=\"footnotes\">\n<hr>\n<ol>\n<li id=\"fn-1\">\n<p>Amazon named it one of the 100 Best Non-Fiction books of the 20th century</p>\n<a href=\"#fnref-1\" class=\"footnote-backref\">↩</a>\n</li>\n<li id=\"fn-2\">\n<p>Some of that may be a relic of this book being originally written in the 80s before computers, his own work and the work of other similar thinkers greatly increased public awareness of data visualization standards like line and bar charts.</p>\n<a href=\"#fnref-2\" class=\"footnote-backref\">↩</a>\n</li>\n</ol>\n</div>","frontmatter":{"title":"Classic Book Review: The Visual Display of Quantitative Information","keywords":"data tufte book review","category":"reviews","date":"2018/03/13","path":"/2018/03/12/classic-book-review-visual-display/","layout":"post","hideFooter":null},"fields":{"slug":"/2018/03/12/classic-book-review-visual-display/"}}},"pageContext":{"slug":"/2018/03/12/classic-book-review-visual-display/","relatedPosts":[{"path":"/2018/02/07/react-confessions/","data":{"title":"React Architecture Confessions","path":"/2018/02/07/react-confessions/","description":"The mistakes I made while learning React and why I made them","date":"2018/02/07","category":"fe-architecture"}},{"path":"/2018/02/14/book-review-clean-architecture/","data":{"title":"Book Review: Clean Architecture","path":"/2018/02/14/book-review-clean-architecture/","description":"Uncle Bob's book on architecture is informative, but limits its scope","date":"2018/02/14","category":"reviews"}},{"path":"/2017/02/18/context-to-best-practices/","data":{"title":"Giving Context To Best Practices","path":"/2017/02/18/context-to-best-practices/","description":"What we talk about when we talk about best practices","date":"2017-02-18T23:30:00+00:00","category":"software-productivity"}}]}}